---
kind: type
id: T:Autodesk.Revit.DB.SunAndShadowType
source: html/0f990e60-7c79-7a25-42e5-7cfe6abe5b23.htm
---
# Autodesk.Revit.DB.SunAndShadowType

Sun study type enum of SunAndShadowSettings.

## Syntax (C#)
```csharp
public enum SunAndShadowType
```